# Color1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudColorSettings..::..Color1 Property
PointCloudColorSettings Class See Also
---
Color 1
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Color Color1 { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Color1 As Color
	Get
```

Visual C++
---
```text
public:
property Color^ Color1 {
	Color^ get ();
}
```

# See Also
PointCloudColorSettings Class
Autodesk.Revit.DB.PointClouds Namespace